posts/20241002-imagescope-to-slideflow.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Converting Aperio Imagescope XML Annotations to Slideflow's CSV Format</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Fira+Mono:wght@400;700&amp;display=swap" rel="stylesheet">
<link rel="icon" href="spock-favicon.png" type="image/png">
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <a href="/index.html"><h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>Lafith Mattara</h2></a>
  <div class='topnav2' style='color:#cfcaca;'>
    <a href='/blog.html' style='font-weight:bold; font-style:bold;'>Blog </a> / 
    <a href='./LafithCV.pdf' style='font-weight:bold; font-style:bold;'>CV </a>
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content">
<header>
<h1 class="title">Converting Aperio Imagescope XML Annotations to Slideflow's CSV Format</h1>
</header><p>
Working with digital pathology often involves handling annotations from various software platforms. <a href="https://www.leicabiosystems.com/digital-pathology/manage/aperio-imagescope/">Aperio ImageScope</a> is a popular tool for viewing and annotating digital pathology images and  <a href="https://slideflow.dev/">Slideflow</a> is a Python framework used for deep learning tasks in digital pathology. While <b>ImageScope</b> saves the annotations in XML format, <b>Slideflow</b> saves it in a CSV format.
</p>

<p>
In this post I will share a python function that allows you to convert Aperio Imagescope XML annotations into a format that Slideflow can easily work with.
</p>

<p>
Here is an example of a typical ImageScope XML file structure that contains annotations for regions of interest (ROIs) on a digital slide.
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Annotations</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Annotation</span> <span class="org-nxml-attribute-local-name">Id</span>=<span class="org-string">"0"</span> <span class="org-nxml-attribute-local-name">Name</span>=<span class="org-string">"Annotation 1"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Attributes</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Attribute</span> <span class="org-nxml-attribute-local-name">Name</span>=<span class="org-string">"RegionType"</span> <span class="org-nxml-attribute-local-name">Value</span>=<span class="org-string">"Tissue"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Attributes</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Regions</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Region</span> <span class="org-nxml-attribute-local-name">Id</span>=<span class="org-string">"0"</span> <span class="org-nxml-attribute-local-name">Type</span>=<span class="org-string">"1"</span> <span class="org-nxml-attribute-local-name">NegativeROA</span>=<span class="org-string">"0"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertices</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertex</span> <span class="org-nxml-attribute-local-name">X</span>=<span class="org-string">"100.0"</span> <span class="org-nxml-attribute-local-name">Y</span>=<span class="org-string">"150.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertex</span> <span class="org-nxml-attribute-local-name">X</span>=<span class="org-string">"200.0"</span> <span class="org-nxml-attribute-local-name">Y</span>=<span class="org-string">"250.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertex</span> <span class="org-nxml-attribute-local-name">X</span>=<span class="org-string">"300.0"</span> <span class="org-nxml-attribute-local-name">Y</span>=<span class="org-string">"350.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertex</span> <span class="org-nxml-attribute-local-name">X</span>=<span class="org-string">"100.0"</span> <span class="org-nxml-attribute-local-name">Y</span>=<span class="org-string">"150.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Vertices</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Region</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Region</span> <span class="org-nxml-attribute-local-name">Id</span>=<span class="org-string">"1"</span> <span class="org-nxml-attribute-local-name">Type</span>=<span class="org-string">"1"</span> <span class="org-nxml-attribute-local-name">NegativeROA</span>=<span class="org-string">"0"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertices</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertex</span> <span class="org-nxml-attribute-local-name">X</span>=<span class="org-string">"400.0"</span> <span class="org-nxml-attribute-local-name">Y</span>=<span class="org-string">"450.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertex</span> <span class="org-nxml-attribute-local-name">X</span>=<span class="org-string">"500.0"</span> <span class="org-nxml-attribute-local-name">Y</span>=<span class="org-string">"550.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Vertex</span> <span class="org-nxml-attribute-local-name">X</span>=<span class="org-string">"600.0"</span> <span class="org-nxml-attribute-local-name">Y</span>=<span class="org-string">"650.0"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Vertices</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Region</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Regions</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Annotation</span><span class="org-nxml-tag-delimiter">&gt;</span>

  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">Annotation</span> <span class="org-nxml-attribute-local-name">Id</span>=<span class="org-string">"1"</span> <span class="org-nxml-attribute-local-name">Name</span>=<span class="org-string">"Annotation 2"</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">   ...</span>
<span class="org-nxml-text">  </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Annotation</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">Annotations</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
This is how the same data would be structured in a SlideFlow-compatible CSV format
</p>
<div class="org-src-container">
<pre class="src src-txt">roi_name,x_base,y_base,label
Annotation_1_0,100.0,150.0,Tissue
Annotation_1_0,200.0,250.0,Tissue
Annotation_1_0,300.0,350.0,Tissue
Annotation_1_0,100.0,150.0,Tissue
Annotation_1_1,400.0,450.0,Tissue
Annotation_1_1,500.0,550.0,Tissue
Annotation_1_1,600.0,650.0,Tissue
Annotation_2_0,700.0,750.0,Tumor
Annotation_2_0,800.0,850.0,Tumor
Annotation_2_0,900.0,950.0,Tumor
</pre>
</div>

<p>
Following Python function read the XML file given it's file path and returns a pandas dataframe. You can save it using <i>pd.to_csv()</i>.
The aperio2sf function parses the XML file and extracts each region's X and Y coordinates, which are stored in the x_base and y_base columns. The label column corresponds to the region name, and roi_name stores the name of each region, suffixed with a unique index.
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> os
<span class="org-keyword">import</span> shutil
<span class="org-keyword">import</span> pandas <span class="org-keyword">as</span> pd
<span class="org-keyword">import</span> xml.dom.minidom <span class="org-keyword">as</span> minidom


<span class="org-keyword">def</span> <span class="org-function-name">aperio2sf</span>(annt_path):
    <span class="org-comment-delimiter"># </span><span class="org-comment">read the aperio xml file</span>
    <span class="org-variable-name">doc</span> = minidom.parse(annt_path)
    <span class="org-variable-name">annotations</span> = doc.getElementsByTagName(<span class="org-string">"Annotation"</span>)
    <span class="org-comment-delimiter"># </span><span class="org-comment">initialize relevant columns for slideflow format</span>
    <span class="org-variable-name">data</span> = {
        <span class="org-string">'roi_name'</span>: [],
        <span class="org-string">'label'</span>:[],
        <span class="org-string">'x_base'</span>: [],
        <span class="org-string">'y_base'</span>: []
    }
    <span class="org-comment-delimiter"># </span><span class="org-comment">extract the corresponding information parsing the xml</span>
    <span class="org-keyword">for</span> annotation <span class="org-keyword">in</span> annotations:
        <span class="org-variable-name">name</span> = annotation.getElementsByTagName(<span class="org-string">"Attribute"</span>)[0].getAttribute(<span class="org-string">"Name"</span>)
        <span class="org-variable-name">regions</span> = annotation.getElementsByTagName(<span class="org-string">"Region"</span>)
        <span class="org-keyword">for</span> i,region <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(regions):
            <span class="org-variable-name">vertices</span> = region.getElementsByTagName(<span class="org-string">"Vertex"</span>)
            <span class="org-keyword">for</span> j,vertex <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(vertices):
                data[<span class="org-string">'x_base'</span>].append(vertex.getAttribute(<span class="org-string">"X"</span>))
                data[<span class="org-string">'y_base'</span>].append(vertex.getAttribute(<span class="org-string">"Y"</span>))
                data[<span class="org-string">'label'</span>].append(name)
                data[<span class="org-string">'roi_name'</span>].append(name+<span class="org-string">"_"</span>+<span class="org-builtin">str</span>(i))
    <span class="org-variable-name">df</span> = pd.DataFrame(data)
    <span class="org-keyword">return</span> df
</pre>
</div>

<p>
The slideflow project's default config expects the annotations to be at <i>slides/rois</i> location. This function converts all Aperio XML files in the <i>annotations</i> folder to CSV format and saves them in the slides/rois folder, ready for Slideflow to process.
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">convertall</span>(data_dir, sf_dest=<span class="org-string">"rois"</span>):
    <span class="org-doc">'''</span>
<span class="org-doc">    convert all aperio xmls into slideflow formats and save into slides/rois folder</span>
<span class="org-doc">    '''</span>
    <span class="org-keyword">if</span> os.path.exists(os.path.join(data_dir,<span class="org-string">"slides"</span>, sf_dest)):
        shutil.rmtree(os.path.join(data_dir,<span class="org-string">"slides"</span>, sf_dest))
    os.makedirs(os.path.join(data_dir,<span class="org-string">"slides"</span>, sf_dest), exist_ok=<span class="org-constant">True</span>)
    <span class="org-keyword">for</span> annt_path <span class="org-keyword">in</span> os.listdir(os.path.join(data_dir, <span class="org-string">"annotations"</span>)):
        <span class="org-keyword">print</span>(annt_path)
        <span class="org-variable-name">annt_path</span> = os.path.join(data_dir,<span class="org-string">"annotations"</span>, annt_path)
        <span class="org-variable-name">df</span> = aperio2sf(annt_path)
        <span class="org-variable-name">out_path</span> = annt_path.replace(<span class="org-string">"annotations"</span>, <span class="org-string">"slides/"</span>+sf_dest)
        <span class="org-variable-name">out_path</span> = out_path.replace(<span class="org-string">"xml"</span>, <span class="org-string">"csv"</span>)
        df.to_csv(out_path, sep=<span class="org-string">','</span>, index=<span class="org-constant">False</span>)
</pre>
</div>

<p>
Since the CSV content follows a generic tabular format it can also be used to generate annotation files for other software platforms, such as <a href="https://qupath.github.io/">QuPath</a>.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-10-02 Wed 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
